Revit 2026 API

# ReferenceableViewUtils Class

---

Utilities related to reference views such as reference sections and reference callouts.

SystemObject Autodesk.Revit.DBReferenceableViewUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ReferenceableViewUtils
```
```vb
Public NotInheritable Class ReferenceableViewUtils
```
```cpp
public ref class ReferenceableViewUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ReferenceableViewUtils = class end
```

The ReferenceableViewUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ChangeReferencedView | Changes a particular reference view (such as a reference section or reference callout) to refer to a different View. |
|  | GetReferencedViewId | Gets the id of the view referenced by a reference view (such as a reference section or reference callout). |

#### Reference

Autodesk.Revit.DB Namespace